#include <stdio.h>
int main(void)
{
    int A[6] = { 1, 5, 1, 2, 7, 5 };
    //A[0]=1,A[1]=5,A[2]=1,A[3]=2,A[4]=7,A[5]=5

    for (int i = 0; i < 6; i++) //0~5 반복
        if ((i + 1) % 2 == 0)
            //i가 0일때 (0+1) %2=>2로 나눈 나머지가 
            //0 와 같냐(짝수을의미) -> 넘어감
        {
            printf("%d", A[i]); // 짝수일때 i를 출력
        }
}
// i->0  (0+1)%2 == 0 -> 넘어감
// i->1  (1+1)%2 ==0 -> i가 1=> A[1]=5출력
// i->2  (2+1)%2 == 0 -> 넘어감
// i->3 (3+1)%2 == 0 -> i가 3=> A[3]=2출력
// i->4 (4+1)%2 == 0 -> 넘어감
// i->5  (5+1)%2 == 0-> i가 5=> A[5]=5출력
